xdu-aero-association/FM33LC0XX_Example_0.04/ADC 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_lcd.h
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_ll_lcd.h
  * @author  FMSH Application Team
  * @brief   Head file of LCD LL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LC0XX_LL_LCD_H
#define __FM33LC0XX_LL_LCD_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "FM33xx.h"
/** @addtogroup FM33LC0XX_LL_Driver_LCD
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup LCD_LL_ES_INIT LCD Exported Init structures
  * @{
  */

/**
  * @brief LL LCD Init Sturcture definition
  */
typedef struct
{
    /*! 电流源大小控制 */
    uint32_t ICCtrl;         
    /*! 驱动模式 */
    uint32_t EnableMode;
    /*! 偏执电平 */
    uint32_t BiasVoltage;
    /*! 偏执类型 */
    uint32_t BiasMode;    
    /*! 驱动波形 */    
    uint32_t Waveform;
	/*! COM数目 */    
    uint32_t COMxNum;
    /*! 显示频率 */    
    uint32_t FreqPsc;
    /*! 显示闪烁点亮时间(ms) */
    uint32_t FlickOnTime;
    /*! 显示闪烁熄灭时间(ms) */
    uint32_t FlickOffTime;
}LL_LCD_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup LCD_LL_Exported_Constants LCD Exported Constants
  * @{
  */
#define    LL_LCD_DATA_REG_0                                      (0x0U << 0U)
#define    LL_LCD_DATA_REG_1                                      (0x1U << 0U)
#define    LL_LCD_DATA_REG_2                                      (0x2U << 0U)
#define    LL_LCD_DATA_REG_3                                      (0x3U << 0U)
#define    LL_LCD_DATA_REG_4                                      (0x4U << 0U)
#define    LL_LCD_DATA_REG_5                                      (0x5U << 0U)
#define    LL_LCD_DATA_REG_6                                      (0x6U << 0U)
#define    LL_LCD_DATA_REG_7                                      (0x7U << 0U)
#define    LL_LCD_DATA_REG_8                                      (0x8U << 0U)
#define    LL_LCD_COM_EN_COM0                                     (0x1U << 0U)
#define    LL_LCD_COM_EN_COM1                                     (0x1U << 1U)
#define    LL_LCD_COM_EN_COM2                                     (0x1U << 2U)
#define    LL_LCD_COM_EN_COM3                                     (0x1U << 3U)
#define    LL_LCD_COM_EN_COM4                                     (0x1U << 28U)
#define    LL_LCD_COM_EN_COM5                                     (0x1U << 29U)
#define    LL_LCD_COM_EN_COM6                                     (0x1U << 30U)
#define    LL_LCD_COM_EN_COM7                                     (0x1U << 31U)
#define    LL_LCD_SEG_EN0_SEG0                                    (0x1U << 0U)
#define    LL_LCD_SEG_EN0_SEG1                                    (0x1U << 1U)
#define    LL_LCD_SEG_EN0_SEG2                                    (0x1U << 2U)
#define    LL_LCD_SEG_EN0_SEG3                                    (0x3U << 3U)
#define    LL_LCD_SEG_EN0_SEG4                                    (0x1U << 4U)
#define    LL_LCD_SEG_EN0_SEG5                                    (0x1U << 5U)
#define    LL_LCD_SEG_EN0_SEG6                                    (0x1U << 6U)
#define    LL_LCD_SEG_EN0_SEG7                                    (0x1U << 7U)
#define    LL_LCD_SEG_EN0_SEG8                                    (0x1U << 8U)
#define    LL_LCD_SEG_EN0_SEG9                                    (0x1U << 9U)
#define    LL_LCD_SEG_EN0_SEG10                                   (0x1U << 10U)
#define    LL_LCD_SEG_EN0_SEG11                                   (0x1U << 11U)
#define    LL_LCD_SEG_EN0_SEG12                                   (0x1U << 12U)
#define    LL_LCD_SEG_EN0_SEG13                                   (0x1U << 13U)
#define    LL_LCD_SEG_EN0_SEG14                                   (0x1U << 14U)
#define    LL_LCD_SEG_EN0_SEG15                                   (0x1U << 15U)
#define    LL_LCD_SEG_EN0_SEG16                                   (0x1U << 16U)
#define    LL_LCD_SEG_EN0_SEG17                                   (0x1U << 17U)
#define    LL_LCD_SEG_EN0_SEG18                                   (0x1U << 18U)
#define    LL_LCD_SEG_EN0_SEG19                                   (0x1U << 19U)
#define    LL_LCD_SEG_EN0_SEG20                                   (0x1U << 20U)
#define    LL_LCD_SEG_EN0_SEG21                                   (0x1U << 21U)
#define    LL_LCD_SEG_EN0_SEG22                                   (0x1U << 22U)
#define    LL_LCD_SEG_EN0_SEG23                                   (0x1U << 23U)
#define    LL_LCD_SEG_EN0_SEG24                                   (0x1U << 24U)
#define    LL_LCD_SEG_EN0_SEG25                                   (0x1U << 25U)
#define    LL_LCD_SEG_EN0_SEG26                                   (0x1U << 26U)
#define    LL_LCD_SEG_EN0_SEG27                                   (0x1U << 27U)
#define    LL_LCD_SEG_EN0_SEG28                                   (0x1U << 28U)
#define    LL_LCD_SEG_EN0_SEG29                                   (0x1U << 29U)
#define    LL_LCD_SEG_EN0_SEG30                                   (0x1U << 30U)
#define    LL_LCD_SEG_EN0_SEG31                                   (0x1U << 31U)



