xdu-aero-association/FM33LC0XX_Example_0.04/ADC 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_lcd.h
#define    LCD_CR_IC_CTRL_Pos                                     (16U)
#define    LCD_CR_IC_CTRL_Msk                                     (0x3U << LCD_CR_IC_CTRL_Pos)
#define    LCD_CR_IC_CTRL                                         LCD_CR_IC_CTRL_Msk
#define    LL_LCD_DRV_IC_CTRL_LARGETS                             (0x0U << LCD_CR_IC_CTRL_Pos)
#define    LL_LCD_DRV_IC_CTRL_LARGE                               (0x1U << LCD_CR_IC_CTRL_Pos)
#define    LL_LCD_DRV_IC_CTRL_SMALL                               (0x2U << LCD_CR_IC_CTRL_Pos)
#define    LL_LCD_DRV_IC_CTRL_MININUM                             (0x3U << LCD_CR_IC_CTRL_Pos)


#define    LCD_CR_ENMODE_Pos                                      (15U)
#define    LCD_CR_ENMODE_Msk                                      (0x1U << LCD_CR_ENMODE_Pos)
#define    LCD_CR_ENMODE                                          LCD_CR_ENMODE_Msk
#define    LL_LCD_DRV_ENMODE_INNERRESISTER                        (0x1U << LCD_CR_ENMODE_Pos)


#define    LCD_CR_FLICK_Pos                                       (14U)
#define    LCD_CR_FLICK_Msk                                       (0x1U << LCD_CR_FLICK_Pos)
#define    LCD_CR_FLICK                                           LCD_CR_FLICK_Msk
#define    LL_LCD_DISPCTRL_FLICK_DISABLE                          (0x0U << LCD_CR_FLICK_Pos)
#define    LL_LCD_DISPCTRL_FLICK_ENABLE                           (0x1U << LCD_CR_FLICK_Pos)


#define    LCD_CR_BIAS_Pos                                        (8U)
#define    LCD_CR_BIAS_Msk                                        (0xfU << LCD_CR_BIAS_Pos)
#define    LCD_CR_BIAS                                            LCD_CR_BIAS_Msk
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_0                         (0x0U << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_1                         (0x1U << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_2                         (0x2U << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_3                         (0x3U << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_4                         (0x4U << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_5                         (0x5U << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_6                         (0x6U << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_7                         (0x7U << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_8                         (0x8U << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_9                         (0x9U << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_10                        (0xaU << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_11                        (0xbU << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_12                        (0xcU << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_13                        (0xdU << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_14                        (0xeU << LCD_CR_BIAS_Pos)
#define    LL_LCD_GRAY_SCALE_CTRL_LEVEL_15                        (0xfU << LCD_CR_BIAS_Pos)


#define    LCD_CR_BIASMD_Pos                                      (5U)
#define    LCD_CR_BIASMD_Msk                                      (0x1U << LCD_CR_BIASMD_Pos)
#define    LCD_CR_BIASMD                                          LCD_CR_BIASMD_Msk
#define    LL_LCD_SET_BIASMD_DIV4BIAS                             (0x0U << LCD_CR_BIASMD_Pos)
#define    LL_LCD_SET_BIASMD_DIV3BIAS                             (0x1U << LCD_CR_BIASMD_Pos)


#define    LCD_CR_ANTIPOLAR_Pos                                   (4U)
#define    LCD_CR_ANTIPOLAR_Msk                                   (0x1U << LCD_CR_ANTIPOLAR_Pos)
#define    LCD_CR_ANTIPOLAR                                       LCD_CR_ANTIPOLAR_Msk
#define    LL_LCD_DISPCTRL_ANTIPOLAR_FLOATING                     (0x0U << LCD_CR_ANTIPOLAR_Pos)
#define    LL_LCD_DISPCTRL_ANTIPOLAR_GND                          (0x1U << LCD_CR_ANTIPOLAR_Pos)


#define    LCD_CR_WFT_Pos                                         (3U)
#define    LCD_CR_WFT_Msk                                         (0x1U << LCD_CR_WFT_Pos)
#define    LCD_CR_WFT                                             LCD_CR_WFT_Msk
#define    LL_LCD_WAVEFORM_FORMAT_TYPE_A                          (0x0U << LCD_CR_WFT_Pos)
#define    LL_LCD_WAVEFORM_FORMAT_TYPE_B                          (0x1U << LCD_CR_WFT_Pos)


#define    LCD_CR_LMUX_Pos                                        (1U)
#define    LCD_CR_LMUX_Msk                                        (0x3U << LCD_CR_LMUX_Pos)
#define    LCD_CR_LMUX                                            LCD_CR_LMUX_Msk
#define    LL_LCD_SEG_LINE_SELECT_COM_4                           (0x0U << LCD_CR_LMUX_Pos)
#define    LL_LCD_SEG_LINE_SELECT_COM_6                           (0x1U << LCD_CR_LMUX_Pos)
#define    LL_LCD_SEG_LINE_SELECT_COM_8                           (0x2U << LCD_CR_LMUX_Pos)


#define    LCD_CR_EN_Pos                                          (0U)
#define    LCD_CR_EN_Msk                                          (0x1U << LCD_CR_EN_Pos)
#define    LCD_CR_EN                                              LCD_CR_EN_Msk



#define    LCD_TEST_LCCTRL_Pos                                    (7U)
#define    LCD_TEST_LCCTRL_Msk                                    (0x1U << LCD_TEST_LCCTRL_Pos)
#define    LCD_TEST_LCCTRL                                        LCD_TEST_LCCTRL_Msk
#define    LL_LCD_TEST_MODE_LCCTRL_0                              (0x0U << LCD_TEST_LCCTRL_Pos)
#define    LL_LCD_TEST_MODE_LCCTRL_1                              (0x1U << LCD_TEST_LCCTRL_Pos)


#define    LCD_TEST_TESTEN_Pos                                    (0U)
#define    LCD_TEST_TESTEN_Msk                                    (0x1U << LCD_TEST_TESTEN_Pos)
#define    LCD_TEST_TESTEN                                        LCD_TEST_TESTEN_Msk



#define    LCD_FCR_DF_Pos                                         (0U)
#define    LCD_FCR_DF_Msk                                         (0xffU << LCD_FCR_DF_Pos)
#define    LCD_FCR_DF                                             LCD_FCR_DF_Msk


#define    LCD_FLKT_TOFF_Pos                                      (8U)
#define    LCD_FLKT_TOFF_Msk                                      (0xffU << LCD_FLKT_TOFF_Pos)
#define    LCD_FLKT_TOFF                                          LCD_FLKT_TOFF_Msk


#define    LCD_FLKT_TON_Pos                                       (0U)
#define    LCD_FLKT_TON_Msk                                       (0xffU << LCD_FLKT_TON_Pos)
#define    LCD_FLKT_TON                                           LCD_FLKT_TON_Msk


#define    LCD_IER_DONIE_Pos                                      (1U)
#define    LCD_IER_DONIE_Msk                                      (0x1U << LCD_IER_DONIE_Pos)
#define    LCD_IER_DONIE                                          LCD_IER_DONIE_Msk



#define    LCD_IER_DOFFIE_Pos                                     (0U)
#define    LCD_IER_DOFFIE_Msk                                     (0x1U << LCD_IER_DOFFIE_Pos)
#define    LCD_IER_DOFFIE                                         LCD_IER_DOFFIE_Msk



