xdu-aero-association/FM33LC0XX_Example_0.04/ADC 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_lcd.h
#define    LCD_ISR_DONIF_Pos                                      (1U)
#define    LCD_ISR_DONIF_Msk                                      (0x1U << LCD_ISR_DONIF_Pos)
#define    LCD_ISR_DONIF                                          LCD_ISR_DONIF_Msk


#define    LCD_ISR_DOFFIF_Pos                                     (0U)
#define    LCD_ISR_DOFFIF_Msk                                     (0x1U << LCD_ISR_DOFFIF_Pos)
#define    LCD_ISR_DOFFIF                                         LCD_ISR_DOFFIF_Msk


#define    LCD_DATA0_DSDA_Pos                                     (0U)
#define    LCD_DATA0_DSDA_Msk                                     (0xffffffffU << LCD_DATA0_DSDA_Pos)
#define    LCD_DATA0_DSDA                                         LCD_DATA0_DSDA_Msk


/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup LCD_LL_Exported_Functions LCD Exported Functions
  * @{
  */

/**
  * @brief    
  * @rmtoll   CR    IC_CTRL    LL_LCD_SetICCtrl
  * @param    LCDx LCD instance
  * @param    ICCtrl This parameter can be one of the following values:
  *           @arg @ref LL_LCD_DRV_IC_CTRL_LARGETS
  *           @arg @ref LL_LCD_DRV_IC_CTRL_LARGE
  *           @arg @ref LL_LCD_DRV_IC_CTRL_SMALL
  *           @arg @ref LL_LCD_DRV_IC_CTRL_MININUM
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetICCtrl(LCD_Type* LCDx, uint32_t ICCtrl)
{
    MODIFY_REG(LCDx->CR, LCD_CR_IC_CTRL_Msk, ICCtrl);
}

/**
  * @brief    
  * @rmtoll   CR    IC_CTRL    LL_LCD_GetICCtrl
  * @param    LCDx LCD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LCD_DRV_IC_CTRL_LARGETS
  *           @arg @ref LL_LCD_DRV_IC_CTRL_LARGE
  *           @arg @ref LL_LCD_DRV_IC_CTRL_SMALL
  *           @arg @ref LL_LCD_DRV_IC_CTRL_MININUM
  */
__STATIC_INLINE uint32_t LL_LCD_GetICCtrl(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_IC_CTRL_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    ENMODE    LL_LCD_SetEnableMode
  * @param    LCDx LCD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref LL_LCD_DRV_ENMODE_INNERRESISTER
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetEnableMode(LCD_Type* LCDx, uint32_t mode)
{
    MODIFY_REG(LCDx->CR, LCD_CR_ENMODE_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CR    ENMODE    LL_LCD_GetEnableMode
  * @param    LCDx LCD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LCD_DRV_ENMODE_INNERRESISTER
  */
__STATIC_INLINE uint32_t LL_LCD_GetEnableMode(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_ENMODE_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    FLICK    LL_LCD_SetDisplayFlick
  * @param    LCDx LCD instance
  * @param    state This parameter can be one of the following values:
  *           @arg @ref LL_LCD_DISPCTRL_FLICK_DISABLE
  *           @arg @ref LL_LCD_DISPCTRL_FLICK_ENABLE
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetDisplayFlick(LCD_Type* LCDx, uint32_t state)
{
    MODIFY_REG(LCDx->CR, LCD_CR_FLICK_Msk, state);
}

/**
  * @brief    
  * @rmtoll   CR    FLICK    LL_LCD_GetDisplayFlick
  * @param    LCDx LCD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LCD_DISPCTRL_FLICK_DISABLE
  *           @arg @ref LL_LCD_DISPCTRL_FLICK_ENABLE
  */
__STATIC_INLINE uint32_t LL_LCD_GetDisplayFlick(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_FLICK_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    BIAS    LL_LCD_SetBiasVoltage
  * @param    LCDx LCD instance
  * @param    voltage This parameter can be one of the following values:
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_0
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_1
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_2
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_3
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_4
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_5
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_6
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_7
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_8
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_9
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_10
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_11
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_12
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_13
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_14
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_15
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetBiasVoltage(LCD_Type* LCDx, uint32_t voltage)
{
    MODIFY_REG(LCDx->CR, LCD_CR_BIAS_Msk, voltage);
}

/**
  * @brief    
  * @rmtoll   CR    BIAS    LL_LCD_GetBiasVoltage
  * @param    LCDx LCD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_0
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_1
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_2
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_3
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_4
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_5
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_6
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_7
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_8
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_9
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_10
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_11
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_12
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_13
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_14
  *           @arg @ref LL_LCD_GRAY_SCALE_CTRL_LEVEL_15
  */
__STATIC_INLINE uint32_t LL_LCD_GetBiasVoltage(LCD_Type* LCDx)
{
    return (READ_BIT(LCDx->CR, LCD_CR_BIAS_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    BIASMD    LL_LCD_SetBiasMode
  * @param    LCDx LCD instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref LL_LCD_SET_BIASMD_1_DIV4BIAS
  *           @arg @ref LL_LCD_SET_BIASMD_1_DIV3BIAS
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetBiasMode(LCD_Type* LCDx, uint32_t mode)
{
    MODIFY_REG(LCDx->CR, LCD_CR_BIASMD_Msk, mode);
}

/**
  * @brief    
  * @rmtoll   CR    BIASMD    LL_LCD_GetBiasMode
  * @param    LCDx LCD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LCD_SET_BIASMD_1_DIV4BIAS
  *           @arg @ref LL_LCD_SET_BIASMD_1_DIV3BIAS
  */
__STATIC_INLINE uint32_t LL_LCD_GetBiasMode(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_BIASMD_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    ANTIPOLAR    LL_LCD_SetAntiPolar
  * @param    LCDx LCD instance
  * @param    state This parameter can be one of the following values:
  *           @arg @ref LL_LCD_DISPCTRL_ANTIPOLAR_FLOATING
  *           @arg @ref LL_LCD_DISPCTRL_ANTIPOLAR_GND
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetAntiPolar(LCD_Type* LCDx, uint32_t state)
{
    MODIFY_REG(LCDx->CR, LCD_CR_ANTIPOLAR_Msk, state);
}

/**
  * @brief    
  * @rmtoll   CR    ANTIPOLAR    LL_LCD_GetAntiPolar
  * @param    LCDx LCD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LCD_DISPCTRL_ANTIPOLAR_FLOATING
  *           @arg @ref LL_LCD_DISPCTRL_ANTIPOLAR_GND
  */
__STATIC_INLINE uint32_t LL_LCD_GetAntiPolar(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_ANTIPOLAR_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    WFT    LL_LCD_SetWaveform
  * @param    LCDx LCD instance
  * @param    state This parameter can be one of the following values:
  *           @arg @ref LL_LCD_WAVEFORM_FORMAT_TYPE_A
  *           @arg @ref LL_LCD_WAVEFORM_FORMAT_TYPE_B
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetWaveform(LCD_Type* LCDx, uint32_t state)
{
    MODIFY_REG(LCDx->CR, LCD_CR_WFT_Msk, state);
}

/**
  * @brief    
  * @rmtoll   CR    WFT    LL_LCD_GetWaveform
  * @param    LCDx LCD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LCD_WAVEFORM_FORMAT_TYPE_A
  *           @arg @ref LL_LCD_WAVEFORM_FORMAT_TYPE_B
  */
__STATIC_INLINE uint32_t LL_LCD_GetWaveform(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_WFT_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    LMUX    LL_LCD_SetCOMxNum
  * @param    LCDx LCD instance
  * @param    number This parameter can be one of the following values:
  *           @arg @ref LL_LCD_SEG_LINE_SELECT_COM_4
  *           @arg @ref LL_LCD_SEG_LINE_SELECT_C0M_6
  *           @arg @ref LL_LCD_SEG_LINE_SELECT_C0M_8
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetCOMxNum(LCD_Type* LCDx, uint32_t number)
{
    MODIFY_REG(LCDx->CR, LCD_CR_LMUX_Msk, number);
}

/**
  * @brief    
  * @rmtoll   CR    LMUX    LL_LCD_GetCOMxNum
  * @param    LCDx LCD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LCD_SEG_LINE_SELECT_COM_4
  *           @arg @ref LL_LCD_SEG_LINE_SELECT_C0M_6
  *           @arg @ref LL_LCD_SEG_LINE_SELECT_C0M_8
  */
__STATIC_INLINE uint32_t LL_LCD_GetCOMxNum(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_LMUX_Msk));
}

/**
  * @brief    
  * @rmtoll   CR    EN    LL_LCD_Enable
  * @param    LCDx LCD instance
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_Enable(LCD_Type* LCDx)
{
    SET_BIT(LCDx->CR, LCD_CR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    EN    LL_LCD_IsEnable
  * @param    LCDx LCD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnable(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->CR, LCD_CR_EN_Msk) == LCD_CR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   CR    EN    LL_LCD_Disable
  * @param    LCDx LCD instance
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_Disable(LCD_Type* LCDx)
{
    CLEAR_BIT(LCDx->CR, LCD_CR_EN_Msk);
}

/**
  * @brief    
  * @rmtoll   TEST    LCCTRL    LL_LCD_SetTestCtrl
  * @param    LCDx LCD instance
  * @param    ctrl This parameter can be one of the following values:
  *           @arg @ref LL_LCD_TEST_MODE_LCCTRL_0
  *           @arg @ref LL_LCD_TEST_MODE_LCCTRL_1
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetTestCtrl(LCD_Type* LCDx, uint32_t ctrl)
{
    MODIFY_REG(LCDx->TEST, LCD_TEST_LCCTRL_Msk, ctrl);
}

/**
  * @brief    
  * @rmtoll   TEST    LCCTRL    LL_LCD_GetTestCtrl
  * @param    LCDx LCD instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref LL_LCD_TEST_MODE_LCCTRL_0
  *           @arg @ref LL_LCD_TEST_MODE_LCCTRL_1
  */
__STATIC_INLINE uint32_t LL_LCD_GetTestCtrl(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->TEST, LCD_TEST_LCCTRL_Msk));
}

/**
  * @brief    
  * @rmtoll   TEST    TESTEN    LL_LCD_Enable_Test
  * @param    LCDx LCD instance
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_Enable_Test(LCD_Type* LCDx)
{
    SET_BIT(LCDx->TEST, LCD_TEST_TESTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   TEST    TESTEN    LL_LCD_tIsEnable_Test
  * @param    LCDx LCD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_tIsEnable_Test(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->TEST, LCD_TEST_TESTEN_Msk) == LCD_TEST_TESTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   TEST    TESTEN    LL_LCD_Disable_Test
  * @param    LCDx LCD instance
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_Disable_Test(LCD_Type* LCDx)
{
    CLEAR_BIT(LCDx->TEST, LCD_TEST_TESTEN_Msk);
}

/**
  * @brief    
  * @rmtoll   FCR    DF    LL_LCD_SetDisplayFrequencyPsc
  * @param    LCDx LCD instance
  * @param    Psc 
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetDisplayFrequencyPsc(LCD_Type* LCDx, uint32_t Psc)
{
    MODIFY_REG(LCDx->FCR, (0xffU << 0U), (Psc << 0U));
}

/**
  * @brief    
  * @rmtoll   FCR    DF    LL_LCD_GetDisplayFrequencyPsc
  * @param    LCDx LCD instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_LCD_GetDisplayFrequencyPsc(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->FCR, 0xffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   FLKT    TOFF    LL_LCD_SetDisplayOffTime
  * @param    LCDx LCD instance
  * @param    time 
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetDisplayOffTime(LCD_Type* LCDx, uint32_t time)
{
    MODIFY_REG(LCDx->FLKT, (0xffU << 8U), (time << 8U));
}

/**
  * @brief    
  * @rmtoll   FLKT    TOFF    LL_LCD_GetDisplayOffTime
  * @param    LCDx LCD instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_LCD_GetDisplayOffTime(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->FLKT, 0xffU) >> 8U);
}

/**
  * @brief    
  * @rmtoll   FLKT    TON    LL_LCD_SetDispalyOnTime
  * @param    LCDx LCD instance
  * @param    time 
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetDispalyOnTime(LCD_Type* LCDx, uint32_t time)
{
    MODIFY_REG(LCDx->FLKT, (0xffU << 0U), (time << 0U));
}

/**
  * @brief    
  * @rmtoll   FLKT    TON    LL_LCD_GetDisplayOnTime
  * @param    LCDx LCD instance
  * @retval   
  */
__STATIC_INLINE uint32_t LL_LCD_GetDisplayOnTime(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->FLKT, 0xffU) >> 0U);
}

/**
  * @brief    
  * @rmtoll   IER    DONIE    LL_LCD_EnableIT_DisplayOff
  * @param    LCDx LCD instance
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_EnableIT_DisplayOff(LCD_Type* LCDx)
{
    SET_BIT(LCDx->IER, LCD_IER_DONIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    DONIE    LL_LCD_DisableIT_DisplayOff
  * @param    LCDx LCD instance
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_DisableIT_DisplayOff(LCD_Type* LCDx)
{
    CLEAR_BIT(LCDx->IER, LCD_IER_DONIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    DONIE    LL_LCD_IsEnableIT_DisplayOff
  * @param    LCDx LCD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnableIT_DisplayOff(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->IER, LCD_IER_DONIE_Msk) == LCD_IER_DONIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    DOFFIE    LL_LCD_EnableIT_DisplayOn
  * @param    LCDx LCD instance
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_EnableIT_DisplayOn(LCD_Type* LCDx)
{
    SET_BIT(LCDx->IER, LCD_IER_DOFFIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    DOFFIE    LL_LCD_DisableIT_DisplayOn
  * @param    LCDx LCD instance
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_DisableIT_DisplayOn(LCD_Type* LCDx)
{
    CLEAR_BIT(LCDx->IER, LCD_IER_DOFFIE_Msk);
}

/**
  * @brief    
  * @rmtoll   IER    DOFFIE    LL_LCD_IsEnableIT_DisplayOn
  * @param    LCDx LCD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnableIT_DisplayOn(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->IER, LCD_IER_DOFFIE_Msk) == LCD_IER_DOFFIE_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    DONIF    LL_LCD_IsActiveFlag_DisplayOff
  * @param    LCDx LCD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsActiveFlag_DisplayOff(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->ISR, LCD_ISR_DONIF_Msk) == (LCD_ISR_DONIF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    DONIF    LL_LCD_ClearFlag_DisplayOff
  * @param    LCDx LCD instance
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_ClearFlag_DisplayOff(LCD_Type* LCDx)
{
    WRITE_REG(LCDx->ISR, LCD_ISR_DONIF_Msk);
}

/**
  * @brief    
  * @rmtoll   ISR    DOFFIF    LL_LCD_IsActiveFlag_DisplayOn
  * @param    LCDx LCD instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsActiveFlag_DisplayOn(LCD_Type* LCDx)
{
    return (uint32_t)(READ_BIT(LCDx->ISR, LCD_ISR_DOFFIF_Msk) == (LCD_ISR_DOFFIF_Msk));
}

/**
  * @brief    
  * @rmtoll   ISR    DOFFIF    LL_LCD_ClearFlag_DisplayOn
  * @param    LCDx LCD instance
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_ClearFlag_DisplayOn(LCD_Type* LCDx)
{
    WRITE_REG(LCDx->ISR, LCD_ISR_DOFFIF_Msk);
}

/**
  * @brief    
  * @rmtoll   DATA0    DSDA    LL_LCD_SetDisplayData
  * @param    LCDx LCD instance
  * @param    data This parameter can be one of the following values:
  * @param    DataRegister This parameter can be one of the following values:
  *           @arg @ref LL_LCD_DATA_REG_0
  *           @arg @ref LL_LCD_DATA_REG_1
  *           @arg @ref LL_LCD_DATA_REG_2
  *           @arg @ref LL_LCD_DATA_REG_3
  *           @arg @ref LL_LCD_DATA_REG_4
  *           @arg @ref LL_LCD_DATA_REG_5
  *           @arg @ref LL_LCD_DATA_REG_6
  *           @arg @ref LL_LCD_DATA_REG_7
  *           @arg @ref LL_LCD_DATA_REG_8
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_SetDisplayData(LCD_Type* LCDx, uint32_t data, uint32_t DataRegister)
{
    volatile uint32_t *Temp_data = &(LCDx->DATA0);
    MODIFY_REG(Temp_data[DataRegister], LCD_DATA0_DSDA_Msk, data);
}

/**
  * @brief    
  * @rmtoll   DATA0    DSDA    LL_LCD_GetDisplayData
  * @param    LCDx LCD instance
  * @param    DataRegister This parameter can be one of the following values:
  *           @arg @ref LL_LCD_DATA_REG_0
  *           @arg @ref LL_LCD_DATA_REG_1
  *           @arg @ref LL_LCD_DATA_REG_2
  *           @arg @ref LL_LCD_DATA_REG_3
  *           @arg @ref LL_LCD_DATA_REG_4
  *           @arg @ref LL_LCD_DATA_REG_5
  *           @arg @ref LL_LCD_DATA_REG_6
  *           @arg @ref LL_LCD_DATA_REG_7
  *           @arg @ref LL_LCD_DATA_REG_8
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t LL_LCD_GetDisplayData(LCD_Type* LCDx, uint32_t DataRegister)
{
    volatile uint32_t *Temp_data = &(LCDx->DATA0);
    return (uint32_t)(READ_BIT(Temp_data[DataRegister], LCD_DATA0_DSDA_Msk));
}

/**
  * @brief    
  * @rmtoll   COMEN        LL_LCD_IsEnabledComPin
  * @param    LCDx LCD instance
  * @param    ComNum This parameter can be one of the following values:
  *           @arg @ref LL_LCD_COM_EN_COM0
  *           @arg @ref LL_LCD_COM_EN_COM1
  *           @arg @ref LL_LCD_COM_EN_COM2
  *           @arg @ref LL_LCD_COM_EN_COM3
  *           @arg @ref LL_LCD_COM_EN_COM4
  *           @arg @ref LL_LCD_COM_EN_COM5
  *           @arg @ref LL_LCD_COM_EN_COM6
  *           @arg @ref LL_LCD_COM_EN_COM7
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnabledComPin(LCD_Type* LCDx, uint32_t ComNum)
{
    if(ComNum <= LL_LCD_COM_EN_COM3)
    {
        return (uint32_t)(READ_BIT(LCDx->COMEN, ((ComNum & 0xffffffff) << 0x0U)) == ((ComNum & 0xffffffff) << 0x0U));
    }
    else
    {
        return (uint32_t)(READ_BIT(LCDx->SEGEN0, ((ComNum & 0xffffffff) << 0x0U)) == ((ComNum & 0xffffffff) << 0x0U));
    }
}

/**
  * @brief    
  * @rmtoll   COMEN        LL_LCD_EnableComPin
  * @param    LCDx LCD instance
  * @param    ComNum This parameter can be one of the following values:
  *           @arg @ref LL_LCD_COM_EN_COM0
  *           @arg @ref LL_LCD_COM_EN_COM1
  *           @arg @ref LL_LCD_COM_EN_COM2
  *           @arg @ref LL_LCD_COM_EN_COM3
  *           @arg @ref LL_LCD_COM_EN_COM4
  *           @arg @ref LL_LCD_COM_EN_COM5
  *           @arg @ref LL_LCD_COM_EN_COM6
  *           @arg @ref LL_LCD_COM_EN_COM7
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_EnableComPin(LCD_Type* LCDx, uint32_t ComNum)
{
    if(ComNum <= LL_LCD_COM_EN_COM3)
    {
        SET_BIT(LCDx->COMEN, ((ComNum & 0xffffffff) << 0x0U));
    }
    else
    {
        SET_BIT(LCDx->SEGEN0, ((ComNum & 0xffffffff) << 0x0U));
    }
}

/**
  * @brief    
  * @rmtoll   COMEN        LL_LCD_DisableComPin
  * @param    LCDx LCD instance
  * @param    ComNum This parameter can be one of the following values:
  *           @arg @ref LL_LCD_COM_EN_COM0
  *           @arg @ref LL_LCD_COM_EN_COM1
  *           @arg @ref LL_LCD_COM_EN_COM2
  *           @arg @ref LL_LCD_COM_EN_COM3
  *           @arg @ref LL_LCD_COM_EN_COM4
  *           @arg @ref LL_LCD_COM_EN_COM5
  *           @arg @ref LL_LCD_COM_EN_COM6
  *           @arg @ref LL_LCD_COM_EN_COM7
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_DisableComPin(LCD_Type* LCDx, uint32_t ComNum)
{
    if(ComNum <= LL_LCD_COM_EN_COM3)
    {
        CLEAR_BIT(LCDx->COMEN, ((ComNum & 0xffffffff) << 0x0U));
    }
    else
    {
        CLEAR_BIT(LCDx->SEGEN0, ((ComNum & 0xffffffff) << 0x0U));
    }
}

/**
  * @brief    
  * @rmtoll   SEGEN0        LL_LCD_IsEnabledSegPin
  * @param    LCDx LCD instance
  * @param    ComNum This parameter can be one of the following values:
  *           @arg @ref LL_LCD_SEG_EN0_SEG0
  *           @arg @ref LL_LCD_SEG_EN0_SEG1
  *           @arg @ref LL_LCD_SEG_EN0_SEG2
  *           @arg @ref LL_LCD_SEG_EN0_SEG3
  *           @arg @ref LL_LCD_SEG_EN0_SEG4
  *           @arg @ref LL_LCD_SEG_EN0_SEG5
  *           @arg @ref LL_LCD_SEG_EN0_SEG6
  *           @arg @ref LL_LCD_SEG_EN0_SEG7
  *           @arg @ref LL_LCD_SEG_EN0_SEG8
  *           @arg @ref LL_LCD_SEG_EN0_SEG9
  *           @arg @ref LL_LCD_SEG_EN0_SEG10
  *           @arg @ref LL_LCD_SEG_EN0_SEG11
  *           @arg @ref LL_LCD_SEG_EN0_SEG12
  *           @arg @ref LL_LCD_SEG_EN0_SEG13
  *           @arg @ref LL_LCD_SEG_EN0_SEG14
  *           @arg @ref LL_LCD_SEG_EN0_SEG15
  *           @arg @ref LL_LCD_SEG_EN0_SEG16
  *           @arg @ref LL_LCD_SEG_EN0_SEG17
  *           @arg @ref LL_LCD_SEG_EN0_SEG18
  *           @arg @ref LL_LCD_SEG_EN0_SEG19
  *           @arg @ref LL_LCD_SEG_EN0_SEG20
  *           @arg @ref LL_LCD_SEG_EN0_SEG21
  *           @arg @ref LL_LCD_SEG_EN0_SEG22
  *           @arg @ref LL_LCD_SEG_EN0_SEG23
  *           @arg @ref LL_LCD_SEG_EN0_SEG24
  *           @arg @ref LL_LCD_SEG_EN0_SEG25
  *           @arg @ref LL_LCD_SEG_EN0_SEG26
  *           @arg @ref LL_LCD_SEG_EN0_SEG27
  *           @arg @ref LL_LCD_SEG_EN0_SEG28
  *           @arg @ref LL_LCD_SEG_EN0_SEG29
  *           @arg @ref LL_LCD_SEG_EN0_SEG30
  *           @arg @ref LL_LCD_SEG_EN0_SEG31
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LCD_IsEnabledSegPin(LCD_Type* LCDx, uint32_t ComNum)
{
    return (uint32_t)(READ_BIT(LCDx->SEGEN0, ((ComNum & 0xffffffff) << 0x0U)) == ((ComNum & 0xffffffff) << 0x0U));
}

/**
  * @brief    
  * @rmtoll   SEGEN0        LL_LCD_EnableSegPin
  * @param    LCDx LCD instance
  * @param    ComNum This parameter can be one of the following values:
  *           @arg @ref LL_LCD_SEG_EN0_SEG0
  *           @arg @ref LL_LCD_SEG_EN0_SEG1
  *           @arg @ref LL_LCD_SEG_EN0_SEG2
  *           @arg @ref LL_LCD_SEG_EN0_SEG3
  *           @arg @ref LL_LCD_SEG_EN0_SEG4
  *           @arg @ref LL_LCD_SEG_EN0_SEG5
  *           @arg @ref LL_LCD_SEG_EN0_SEG6
  *           @arg @ref LL_LCD_SEG_EN0_SEG7
  *           @arg @ref LL_LCD_SEG_EN0_SEG8
  *           @arg @ref LL_LCD_SEG_EN0_SEG9
  *           @arg @ref LL_LCD_SEG_EN0_SEG10
  *           @arg @ref LL_LCD_SEG_EN0_SEG11
  *           @arg @ref LL_LCD_SEG_EN0_SEG12
  *           @arg @ref LL_LCD_SEG_EN0_SEG13
  *           @arg @ref LL_LCD_SEG_EN0_SEG14
  *           @arg @ref LL_LCD_SEG_EN0_SEG15
  *           @arg @ref LL_LCD_SEG_EN0_SEG16
  *           @arg @ref LL_LCD_SEG_EN0_SEG17
  *           @arg @ref LL_LCD_SEG_EN0_SEG18
  *           @arg @ref LL_LCD_SEG_EN0_SEG19
  *           @arg @ref LL_LCD_SEG_EN0_SEG20
  *           @arg @ref LL_LCD_SEG_EN0_SEG21
  *           @arg @ref LL_LCD_SEG_EN0_SEG22
  *           @arg @ref LL_LCD_SEG_EN0_SEG23
  *           @arg @ref LL_LCD_SEG_EN0_SEG24
  *           @arg @ref LL_LCD_SEG_EN0_SEG25
  *           @arg @ref LL_LCD_SEG_EN0_SEG26
  *           @arg @ref LL_LCD_SEG_EN0_SEG27
  *           @arg @ref LL_LCD_SEG_EN0_SEG28
  *           @arg @ref LL_LCD_SEG_EN0_SEG29
  *           @arg @ref LL_LCD_SEG_EN0_SEG30
  *           @arg @ref LL_LCD_SEG_EN0_SEG31
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_EnableSegPin(LCD_Type* LCDx, uint32_t ComNum)
{
    SET_BIT(LCDx->SEGEN0, ((ComNum & 0xffffffff) << 0x0U));
}

