xdu-aero-association/FM33LC0XX_Example_0.04/ADC 示例/Drivers/FM33LC0xx_LL_Driver/Inc/fm33lc0xx_ll_lcd.h
/**
  * @brief    
  * @rmtoll   SEGEN0        LL_LCD_DisableSegPin
  * @param    LCDx LCD instance
  * @param    ComNum This parameter can be one of the following values:
  *           @arg @ref LL_LCD_SEG_EN0_SEG0
  *           @arg @ref LL_LCD_SEG_EN0_SEG1
  *           @arg @ref LL_LCD_SEG_EN0_SEG2
  *           @arg @ref LL_LCD_SEG_EN0_SEG3
  *           @arg @ref LL_LCD_SEG_EN0_SEG4
  *           @arg @ref LL_LCD_SEG_EN0_SEG5
  *           @arg @ref LL_LCD_SEG_EN0_SEG6
  *           @arg @ref LL_LCD_SEG_EN0_SEG7
  *           @arg @ref LL_LCD_SEG_EN0_SEG8
  *           @arg @ref LL_LCD_SEG_EN0_SEG9
  *           @arg @ref LL_LCD_SEG_EN0_SEG10
  *           @arg @ref LL_LCD_SEG_EN0_SEG11
  *           @arg @ref LL_LCD_SEG_EN0_SEG12
  *           @arg @ref LL_LCD_SEG_EN0_SEG13
  *           @arg @ref LL_LCD_SEG_EN0_SEG14
  *           @arg @ref LL_LCD_SEG_EN0_SEG15
  *           @arg @ref LL_LCD_SEG_EN0_SEG16
  *           @arg @ref LL_LCD_SEG_EN0_SEG17
  *           @arg @ref LL_LCD_SEG_EN0_SEG18
  *           @arg @ref LL_LCD_SEG_EN0_SEG19
  *           @arg @ref LL_LCD_SEG_EN0_SEG20
  *           @arg @ref LL_LCD_SEG_EN0_SEG21
  *           @arg @ref LL_LCD_SEG_EN0_SEG22
  *           @arg @ref LL_LCD_SEG_EN0_SEG23
  *           @arg @ref LL_LCD_SEG_EN0_SEG24
  *           @arg @ref LL_LCD_SEG_EN0_SEG25
  *           @arg @ref LL_LCD_SEG_EN0_SEG26
  *           @arg @ref LL_LCD_SEG_EN0_SEG27
  *           @arg @ref LL_LCD_SEG_EN0_SEG28
  *           @arg @ref LL_LCD_SEG_EN0_SEG29
  *           @arg @ref LL_LCD_SEG_EN0_SEG30
  *           @arg @ref LL_LCD_SEG_EN0_SEG31
  * @retval   None
  */
__STATIC_INLINE void LL_LCD_DisableSegPin(LCD_Type* LCDx, uint32_t ComNum)
{
    CLEAR_BIT(LCDx->SEGEN0, ((ComNum & 0xffffffff) << 0x0U));
}

/**
  * @}
  */

/** @defgroup LCD_LL_EF_Init Initialization and de-initialization functions
  * @{
  */
ErrorStatus LL_LCD_DeInit(LCD_Type *LCDx);
void LL_LCD_StructInit(LL_LCD_InitTypeDef *LCD_InitStruct);
ErrorStatus LL_LCD_Init(LCD_Type *LCDx, LL_LCD_InitTypeDef *LCD_InitStruct);
/**
  * @}
  */

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LC0XX_LL_LCD_H*/

/**************************Py_Code_Generator Version: 0.1-0.5-0.1 @ 2019-11-21**************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
